#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.
```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/deep-thought/iac-github/runs/run-S6vcTdgY6WNpd4XJ

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
github_repository.hans-m-song_huisheng: Refreshing state... [id=huisheng]
github_repository.hans-m-song_saml2aws: Refreshing state... [id=saml2aws]
github_repository.hans-m-song_iac: Refreshing state... [id=iac]
github_repository.hans-m-song_kube-stack: Refreshing state... [id=kube-stack]
github_repository_webhook.actions_runner_controller_hans-m-song-huisheng: Refreshing state... [id=397854046]
github_organization_webhook.actions_runner_controller_songmatrix: Refreshing state... [id=397146225]
github_repository.songmatrix_sync-service: Refreshing state... [id=sync-service]
github_repository.songmatrix_data-service: Refreshing state... [id=data-service]
github_repository.songmatrix_frontend-web: Refreshing state... [id=frontend-web]
github_repository.songmatrix_gateway: Refreshing state... [id=gateway]
github_repository.songmatrix_github: Refreshing state... [id=.github]
github_organization_webhook.actions_runner_controller_axatol: Refreshing state... [id=397146175]
github_repository.axatol_actions: Refreshing state... [id=actions]
github_repository.axatol_home-assistant-integrations: Refreshing state... [id=home-assistant-integrations]
github_repository.axatol_youtube-dl: Refreshing state... [id=youtube-dl]
github_repository_webhook.actions_runner_controller_hans-m-song-kube-stack: Refreshing state... [id=397146056]
github_repository_environment.hans-m-song_iac_github: Refreshing state... [id=iac:github]
github_actions_secret.hans-m-song_iac_aws_diff_role_arn: Refreshing state... [id=iac:aws_diff_role_arn]
github_actions_secret.hans-m-song_iac_aws_deploy_role_arn: Refreshing state... [id=iac:aws_deploy_role_arn]
github_actions_repository_oidc_subject_claim_customization_template.hans-m-song_iac: Refreshing state... [id=iac]
github_actions_secret.hans-m-song_iac_terraform_version: Refreshing state... [id=iac:terraform_version]
github_repository_environment.hans-m-song_iac_auth0: Refreshing state... [id=iac:auth0]
github_repository_environment.hans-m-song_iac_aws: Refreshing state... [id=iac:aws]
github_repository_webhook.actions_runner_controller_hans-m-song-iac: Refreshing state... [id=398768556]
github_repository_webhook.actions_runner_controller_hans-m-song-saml2aws: Refreshing state... [id=400589329]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_organization_secret.axatol_aws_ecr_image_publisher_role_arn will be created
  + resource "github_actions_organization_secret" "axatol_aws_ecr_image_publisher_role_arn" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + secret_name     = "AWS_ECR_IMAGE_PUBLISHER_ROLE_ARN"
      + updated_at      = (known after apply)
      + visibility      = "all"
    }

  # github_actions_organization_secret.songmatrix_aws_songmatrix_ecr_image_publisher_role_arn will be created
  + resource "github_actions_organization_secret" "songmatrix_aws_songmatrix_ecr_image_publisher_role_arn" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + secret_name     = "AWS_SONGMATRIX_ECR_IMAGE_PUBLISHER_ROLE_ARN"
      + updated_at      = (known after apply)
      + visibility      = "all"
    }

  # github_actions_secret.hans-m-song_huisheng_aws_ecr_image_publisher_role_arn will be created
  + resource "github_actions_secret" "hans-m-song_huisheng_aws_ecr_image_publisher_role_arn" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "huisheng"
      + secret_name     = "AWS_ECR_IMAGE_PUBLISHER_ROLE_ARN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.hans-m-song_iac_aws_deploy_role_arn must be replaced
-/+ resource "github_actions_secret" "hans-m-song_iac_aws_deploy_role_arn" {
      ~ created_at      = "2023-02-02 13:40:53 +0000 UTC" -> (known after apply)
      ~ id              = "iac:aws_deploy_role_arn" -> (known after apply)
      ~ secret_name     = "aws_deploy_role_arn" -> "AWS_DEPLOY_ROLE_ARN" # forces replacement
      ~ updated_at      = "2023-02-02 13:40:53 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.hans-m-song_iac_aws_diff_role_arn must be replaced
-/+ resource "github_actions_secret" "hans-m-song_iac_aws_diff_role_arn" {
      ~ created_at      = "2023-02-08 10:54:13 +0000 UTC" -> (known after apply)
      ~ id              = "iac:aws_diff_role_arn" -> (known after apply)
      ~ secret_name     = "aws_diff_role_arn" -> "AWS_DIFF_ROLE_ARN" # forces replacement
      ~ updated_at      = "2023-02-08 10:54:13 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.hans-m-song_iac_terraform_version must be replaced
-/+ resource "github_actions_secret" "hans-m-song_iac_terraform_version" {
      ~ created_at      = "2023-02-04 10:36:21 +0000 UTC" -> (known after apply)
      ~ id              = "iac:terraform_version" -> (known after apply)
      ~ secret_name     = "terraform_version" -> "TERRAFORM_VERSION" # forces replacement
      ~ updated_at      = "2023-02-04 10:36:21 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # github_actions_secret.hans-m-song_kube-stack_aws_ecr_image_publisher_role_arn will be created
  + resource "github_actions_secret" "hans-m-song_kube-stack_aws_ecr_image_publisher_role_arn" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "kube-stack"
      + secret_name     = "AWS_ECR_IMAGE_PUBLISHER_ROLE_ARN"
      + updated_at      = (known after apply)
    }

Plan: 7 to add, 0 to change, 3 to destroy.
```

</details>

*Pusher: @hans-m-song, Action: `pull_request`, Working Directory: `github`, Workflow: `Deploy Github`*